In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [3]:
matrix_data = np.matrix('22,66,140; 42,72,148; 30,62,125; 35,68,160; 25,62,152')
row_labels = ['Raj','Panjal','Sridevi','Sunar','Ashvat']
column_headings = ['Age','Height','Weight']

In [7]:
matrix_data

matrix([[ 22,  66, 140],
        [ 42,  72, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [11]:
row_labels

['Raj', 'Panjal', 'Sridevi', 'Sunar', 'Ashvat']

In [13]:
column_headings

['Age', 'Height', 'Weight']

In [17]:
df = pd.DataFrame(data = matrix_data, index = row_labels, columns = column_headings)
print('\n A new DataFrame \n', '-' * 30, sep='')
print(df)

 A new DataFrame
------------------------------
         Age  Height  Weight
Raj       22      66     140
Panjal    42      72     148
Sridevi   30      62     125
Sunar     35      68     160
Ashvat    25      62     152

In [21]:
# To only print height anf weight:
df[['Height', 'Weight']]

         Height  Weight
Raj          66     140
Panjal       72     148
Sridevi      62     125
Sunar        68     160
Ashvat       62     152

In [23]:
# To print 'Age' with .method
# Generally it is not recommended or used. You can only access one column at a time.
df.Age

Raj        22
Panjal     42
Sridevi    30
Sunar      35
Ashvat     25
Name: Age, dtype: int64

In [25]:
# Select particular data and entire correcsponding row data using loc(index name).
# Loc = Locate
df.loc['Raj']

Age        22
Height     66
Weight    140
Name: Raj, dtype: int64

In [27]:
# Select particular index using iloc(index position) and entire correcsponding row data.
# iloc = index location
df.iloc[0]

Age        22
Height     66
Weight    140
Name: Raj, dtype: int64

In [29]:
df

         Age  Height  Weight
Raj       22      66     140
Panjal    42      72     148
Sridevi   30      62     125
Sunar     35      68     160
Ashvat    25      62     152

In [35]:
# Select Data and column for particular data
print(df.loc['Panjal', 'Height'])

72

In [45]:
# Select Data and list of column data
print(df.loc['Ashvat', ['Height', 'Weight']])

Height     62
Weight    152
Name: Ashvat, dtype: int64

In [47]:
# Select Data and list of column data
print(df.loc[['Sunar'], ['Height', 'Weight']])

       Height  Weight
Sunar      68     160

In [41]:
#Select list of Data and column data
print(df.loc[['Ashvat','Sridevi'], ['Height', 'Weight']])

         Height  Weight
Ashvat       62     152
Sridevi      62     125

In [49]:
df

         Age  Height  Weight
Raj       22      66     140
Panjal    42      72     148
Sridevi   30      62     125
Sunar     35      68     160
Ashvat    25      62     152

In [57]:
# Select data on condition
#Check wheather height in greater then 66

print(df[df['Height'] > 66])

        Age  Height  Weight
Panjal   42      72     148
Sunar    35      68     160

In [59]:
# Select Rows with 'Height > 65 inch' and 'Weight > 145 lbs'

booldf1=df['Height']>65
booldf2=df['Weight']>145

print(df[(booldf1) & (booldf2)])

        Age  Height  Weight
Panjal   42      72     148
Sunar    35      68     160

In [75]:
# Another method

print(df[(df['Height'] > 66) & (df['Weight'] > 145)])

        Age  Height  Weight
Panjal   42      72     148
Sunar    35      68     160

In [85]:
# DataFrame with only Age and Weight Columns Whose Height > 65 inch

print(df[(df['Height'] > 65)][['Age','Weight']])

        Age  Weight
Raj      22     140
Panjal   42     148
Sunar    35     160

In [83]:
# Another method

print(df[booldf1][['Age','Weight']])

        Age  Weight
Raj      22     140
Panjal   42     148
Sunar    35     160

In [91]:
# Create new variable and assign the booldf1.

shortlisted = df[booldf1][['Age','Weight']]
shortlisted

        Age  Weight
Raj      22     140
Panjal   42     148
Sunar    35     160

In [93]:
df # Check DataFrame

         Age  Height  Weight
Raj       22      66     140
Panjal    42      72     148
Sridevi   30      62     125
Sunar     35      68     160
Ashvat    25      62     152

In [99]:
# By default, reset_index() moves the current index of the DataFrame into a new column and replaces the index with a default integer index (0, 1, 2, ...).
# To reset index use 'reset_indec()' function.
df.reset_index()

     index  Age  Height  Weight
0      Raj   22      66     140
1   Panjal   42      72     148
2  Sridevi   30      62     125
3    Sunar   35      68     160
4   Ashvat   25      62     152

In [115]:
# Lets print whose age is < 35
# Here index = names
new_df = df[df['Age'] < 35]
new_df

         Age  Height  Weight
Raj       22      66     140
Sridevi   30      62     125
Ashvat    25      62     152

In [117]:
# After resetting index without drop
new_df.reset_index()

     index  Age  Height  Weight
0      Raj   22      66     140
1  Sridevi   30      62     125
2   Ashvat   25      62     152

In [119]:
# After resetting index with drop
new_df.reset_index(drop = True)

   Age  Height  Weight
0   22      66     140
1   30      62     125
2   25      62     152

In [129]:
# Add new Column Profession
new_df['Profession'] = 'Student Teacher Engineer'.split( )
new_df

         Age  Height  Weight Profession
Raj       22      66     140    Student
Sridevi   30      62     125    Teacher
Ashvat    25      62     152   Engineer

In [137]:
# Set 'profession' as index
new_df.set_index('Profession')

            Age  Height  Weight
Profession
Student      22      66     140
Teacher      30      62     125
Engineer     25      62     152